EMOJI_LIB_UK = {
    "🍆🍑": "я би натягнув твій пончик",
    "👉👈": "трохи соромно",
    "😀": "задоволена либа", "😁": "скалиться", "😂": "сміх зі сльозами на очах",
    "🤣": "сміх зі сльозами на очах", "😊": "посміхається", "😄": "максимально задоволена либа",
    "😅": "якось незручно вийшло", "😆": "хвхвхвхвхвхвх", "😉": "легкий флірт",
    "😍": "очі з сердечками", "😘": "цьомки-бомки", "😗": "гайки гайки цьомкай яйки",
    "😙": "губки качечкою", "🥶": "айс айс бейбі", "🫡": "прес еф", "😱": "оуу ноуу", "🤜": "бац",
    "🥵": "ямітейкудасай", "🤪": "я я я кокоджамбо", "😳": "а ой", "😒": "та пішов ти",
    "😚": "обличчя, що цілує з усмішкою, як у закоханого пупсика",
    "😜": "карамба", "🥲":"та за шо",
    "😝": "обличчя з висунутим язиком і закритими очима, як у радісного дітлахи",
    "😛": "відлижу за 2грн", 
    "🤥": "брехло",
    "😲": "єбаанутись", "😴": "вже дрихну", "🤤": "хочу їсти",
    "😪": "", "😵": "обличчя з зірками в очах, як у заблукалого",
    "🤧": "соплю пустив",
    "🌟": " зіірочка ", "👋": "махає рукою", "👉": "туди", "👈": "сюди",
    "🚽": "мама подай горщик", "🚾": "сральня", "🚿": "кімната душності",
    "🏹": "стріляй, тільки не на обличчя", "🤡": "клоун",
    "🤢": "аж знудило", "🤫": "не пизди зайвого", "🤬": "іди на піп хуй",
    "🤮": "беее",
    "🤯": "кукуха полетіла",
    "🤑": "мані мані",
    "🖤": "чорне серце", "🧡": "помаранчеве серденько", "💛": "жовте серденько", "💚": "зелене серденько",
    "💙": "синє серденько", "💜": "фіолетове серденько", "🤎": "обкакане серце", "🤍": "біле серце",
    "💔": "в серденьку боляче", "🔥": "вогник вогник жарко жарко", "❤️": "серденько",
    "💋": "чмок в пупок",
    "🐿️": "білка-дебілка",
    ")": "посмішка", "^^": "щасливе обличча",
    "UwU": "уву", "🤭": "хіхі-хаха", "😷": "мені пізда", "🤒": "я захворів",
    "😯": "охуїти", "🤧": "апчхе блє", "😦": "я в розпачі", "😈": "мозку в мене немає але є цікава думка",
    "🥒": "тільки не в жопу", "🍆": "мій кабачок вже привстав",
    "🩸": "смаколик для ончика", "🤓": "ти дохуя розумний?", "😤": "ти набрид вже",
    "🐹": "хомік курва", "🤐": "рот будеш у стоматолога відкривати",
    "🙀": "мявчик вахуї", "😿":"довели мявчика суки", "😺":"мявчик кайфує", "🙂": "вам пизда", "⚽️": "гооол", ":RemFear:": "ой бляяя", "?": "знак питання",
    "🍑": "пусі", ":angry~1:": "срака мотика"
    }

# "😈": "Мявчик знов збочення робе",


def replace_emojis(text, emojies=EMOJI_LIB_UK):
    for emoticon, description in emojies.items():
        text = text.replace(emoticon, description)

    return text


def show_all_em():
    answer = ""
    for i in EMOJI_LIB_UK:
        answer += f"{i}: {EMOJI_LIB_UK[i]}\n"
    return answer

if __name__ == "__main__":
    text = ""
    for i in EMOJI_LIB_UK:
        text += f"{i}, " 
    print(text)
